final Map<String, Map<String, List<String>>> workoutData = {
  '하체': {
    '바벨': [
      '스쿼트',
      '데드리프트',
      '프론트 스쿼트',
      '바벨 런지',
      '굿모닝',
      '바벨 힙 쓰러스트',
      '오버헤드 스쿼트',
      '스내치',
    ],
    '덤벨': [
      '덤벨 런지',
      '덤벨 스플릿 스쿼트',
      '덤벨 데드리프트',
      '덤벨 스텝업',
      '덤벨 가블렛 스쿼트',
      '덤벨 카프 레이즈',
    ],
    '머신': [
      '레그 프레스',
      '레그 익스텐션',
      '레그 컬',
      '스미스 머신 스쿼트',
      '핵 스쿼트',
      '힙 어브덕터 머신',
    ],
    '케이블': [
      '케이블 킥백',
      '케이블 런지',
      '케이블 글루트 드라이브',
      '케이블 스쿼트',
      '케이블 힙 어브덕션',
    ],
    '맨몸': [
      '점프 스쿼트',
      '불가리안 스플릿 스쿼트',
      '싱글 레그 데드리프트',
      '카프 레이즈',
      '월 싯',
      '글루트 브릿지',
    ],
  },
  '등': {
    '바벨': [
      '바벨 로우',
      '데드리프트',
      'T바 로우',
      '바벨 풀오버',
      '바벨 슈러그',
      '바벨 페이스풀',
      '스내치',
    ],
    '덤벨': [
      '덤벨 로우',
      '덤벨 풀오버',
      '원암 덤벨 로우',
      '덤벨 슈러그',
      '덤벨 리어 델트 로우',
    ],
    '머신': [
      '렛 풀다운',
      '시티드 로우',
      '머신 풀오버',
      '리버스 플라이 머신',
      '허리 익스텐션 머신',
      '어시스티드 풀업 머신',
    ],
    '케이블': [
      '케이블 랫 풀다운',
      '케이블 로우',
      '케이블 풀오버',
      '케이블 페이스 풀',
      '케이블 스트레이트 암 풀다운',
    ],
    '맨몸': [
      '풀업',
      '친업',
      '슈퍼맨 익스텐션',
      '행잉 레그 레이즈',
      '리버스 플라이',
      '브릿지',
    ],
  },
  '가슴': {
    '바벨': [
      '벤치프레스',
      '인클라인 벤치프레스',
      '디클라인 벤치프레스',
      '바벨 플랫 플라이',
      '스미스 머신 벤치프레스',
    ],
    '덤벨': [
      '덤벨 벤치프레스',
      '덤벨 플라이',
      '덤벨 풀오버',
      '덤벨 인클라인 프레스',
      '덤벨 네거티브 벤치프레스',
    ],
    '머신': [
      '체스트 프레스',
      '펙 덱 머신',
      '인클라인 체스트 프레스',
      '머신 플라이',
      '스미스 머신 인클라인 프레스',
    ],
    '케이블': [
      '케이블 크로스오버',
      '케이블 플라이',
      '케이블 프레스',
      '케이블 풀오버',
      '케이블 언더암 크로스오버',
    ],
    '맨몸': [
      '푸쉬업',
      '딥스',
      '클랩 푸쉬업',
      '디클라인 푸쉬업',
      '인클라인 푸쉬업',
      '플라이 푸쉬업',
    ],
  },
  '어깨': {
    '바벨': [
      '바벨 오버헤드 프레스',
      '바벨 프론트 레이즈',
      '바벨 업라이트 로우',
      '바벨 클린 앤 프레스',
      '바벨 리버스 프레스',
    ],
    '덤벨': [
      '덤벨 숄더 프레스',
      '덤벨 레터럴 레이즈',
      '덤벨 리버스 플라이',
      '덤벨 프론트 레이즈',
      '덤벨 아놀드 프레스',
    ],
    '머신': [
      '머신 숄더 프레스',
      '머신 레터럴 레이즈',
      '머신 업라이트 로우',
      '스미스 머신 오버헤드 프레스',
    ],
    '케이블': [
      '케이블 레터럴 레이즈',
      '케이블 프론트 레이즈',
      '케이블 리버스 플라이',
      '케이블 페이스 풀',
      '케이블 업라이트 로우',
    ],
    '맨몸': [
      '핸드스탠드 푸쉬업',
      '파이크 푸쉬업',
      '버드독',
      '사이드 플랭크',
      '크랩 워크',
    ],
  },
  '팔': {
    '바벨': [
      '바벨 컬',
      '클로즈 그립 벤치프레스',
      '바벨 해머 컬',
      '바벨 리버스 컬',
      '바벨 프리처 컬',
      '바벨 스컬크러셔',
    ],
    '덤벨': [
      '덤벨 컬',
      '덤벨 트라이셉스 익스텐션',
      '덤벨 해머 컬',
      '덤벨 컨센트레이션 컬',
      '덤벨 킥백',
      '덤벨 리버스 컬',
    ],
    '케이블': [
      '케이블 푸쉬다운',
      '케이블 트라이셉스 익스텐션',
      '케이블 프론트 컬',
      '케이블 리버스 컬',
      '케이블 오버헤드 익스텐션',
    ],
    '머신': [
      '프리처 컬 머신',
      '트라이셉스 익스텐션 머신',
      '머신 바이셉스 컬',
      '머신 트라이셉스 딥',
    ],
    '맨몸': [
      '다이아몬드 푸쉬업',
      '딥스',
      '플로어 트라이셉스 익스텐션',
      '클로즈 그립 푸쉬업',
      '트라이셉스 딥',
    ],
  },
  '유산소': {
    '머신': [
      '러닝머신',
      '스텝머신',
      '사이클',
      '로잉 머신',
      '크로스 트레이너',
      '에어 바이크',
    ],
    '맨몸': [
      '버피',
      '마운틴 클라이머',
      '점핑 잭',
      '하이 니즈',
      '런지 점프',
      '스케이터 점프',
      '플랭크 잭',
    ],
  },
};

/// 선택한 운동 이름을 기반으로 해당 운동이 속한 머슬 그룹을 반환하는 함수.
String getMuscleGroupForWorkout(String workoutName) {
  for (var muscleGroup in workoutData.keys) {
    final Map<String, List<String>> toolMap = workoutData[muscleGroup]!;
    for (var tool in toolMap.keys) {
      final List<String> workouts = toolMap[tool]!;
      if (workouts.contains(workoutName)) {
        return muscleGroup;
      }
    }
  }
  return '전체';
}
